ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble_event_handler.c
/***************************************************************************//**
* \file cy_ble_event_handler.c
* \version 2.0
*
* \brief
*  This file contains the source code for the Event Handler State Machine
*  of the BLE Component.
*
********************************************************************************
* \copyright
* Copyright 2017, Cypress Semiconductor Corporation.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions,
* disclaimers, and limitations in the end user license agreement accompanying
* the software package with which this file was provided.
*******************************************************************************/

#include "cy_ble_event_handler.h"

/* C binding of definitions if building with C++ compiler */
#ifdef __cplusplus
extern "C" {
#endif /* __cplusplus */

#if (CY_BLE_MODE_PROFILE)

/***************************************
* Private Function Prototypes
***************************************/

static void Cy_BLE_TimeOutEventHandler(const cy_stc_ble_timeout_param_t *eventParam);
static void Cy_BLE_L2Cap_ConnParamUpdateRspEventHandler(const cy_stc_ble_l2cap_conn_update_rsp_param_t *eventParam);
static void Cy_BLE_GAP_ConnUpdateCompleteEventHandler(const cy_stc_ble_gap_conn_param_updated_in_controller_t *eventParam);


#if (CY_BLE_GATT_ROLE_SERVER)
static void Cy_BLE_SendWriteResponse(const cy_stc_ble_gatts_write_cmd_req_param_t *eventParam,
                                     cy_en_ble_gatt_err_code_t gattErr);
#endif /* CY_BLE_GATT_ROLE_SERVER */

#if (CY_BLE_GATT_ROLE_CLIENT)
static void Cy_BLE_GAPC_DiscoverCharacteristicsEventHandler(cy_stc_ble_disc_char_info_t *discCharInfo);
#endif /* CY_BLE_GATT_ROLE_CLIENT */


/***************************************
* Global Variables
***************************************/
volatile uint8_t cy_ble_eventHandlerFlag;
volatile uint8_t cy_ble_busyStatus[CY_BLE_CONN_COUNT];
volatile uint32_t cy_ble_cmdStatus;

#if (CY_BLE_GAP_ROLE_PERIPHERAL || CY_BLE_GAP_ROLE_BROADCASTER)
uint8_t cy_ble_advertisingIntervalType;
#endif /* CY_BLE_GAP_ROLE_PERIPHERAL || CY_BLE_GAP_ROLE_BROADCASTER) */

#if (CY_BLE_GAP_ROLE_CENTRAL || CY_BLE_GAP_ROLE_OBSERVER)
uint8_t cy_ble_scanningIntervalType;
#endif /* CY_BLE_GAP_ROLE_CENTRAL || CY_BLE_GAP_ROLE_OBSERVER */

#if (CY_BLE_GATT_ROLE_CLIENT)
cy_stc_ble_discovery_t cy_ble_discovery[CY_BLE_CONFIG_GATTC_COUNT];
cy_stc_ble_disc_srvc_info_t cy_ble_serverInfo[CY_BLE_CONFIG_GATTC_COUNT][CY_BLE_SRVI_COUNT];
#endif /* CY_BLE_GATT_ROLE_CLIENT */

#if (CY_BLE_GAP_ROLE_PERIPHERAL || CY_BLE_GAP_ROLE_CENTRAL)
cy_stc_ble_event_handler_t cy_ble_eventHandler;


/******************************************************************************
* Function Name: Cy_BLE_RegisterServiceEvtHandler
***************************************************************************//**
*
*  Registration Service Event Handler
*
*  \param  eventHandlerFunc: The pointer to the callback procedure.
*
*  \return
*  cy_en_ble_api_result_t : Return value indicates if the function succeeded or
*  failed. The following are possible error codes.
*
*   Error Codes                           | Description
*   ------------                          | -----------
*   CY_BLE_SUCCESS                        | The function completed successfully.
*   CY_BLE_ERROR_INVALID_PARAMETER        | On specifying NULL as input parameter.
*   CY_BLE_ERROR_MEMORY_ALLOCATION_FAILED | Buffer overflow in the registration callback.
*
******************************************************************************/
cy_en_ble_api_result_t Cy_BLE_RegisterServiceEventHandler(cy_ble_event_handle_t eventHandlerFunc)
{
    cy_en_ble_api_result_t apiResult = CY_BLE_SUCCESS;
    uint8_t existFlag = 0u;

    if(eventHandlerFunc == NULL)
    {
        apiResult = CY_BLE_ERROR_INVALID_PARAMETER;
    }
    else
    {
        /* Check if eventHandlerFunc has been already registered */
        uint32_t idx;
        for(idx = 0u; (idx < cy_ble_eventHandler.count) && (existFlag == 0u); idx++)
        {
            if(cy_ble_eventHandler.serviceEventHandler[idx] == eventHandlerFunc)
            {
                existFlag = 1u;
            }
        }
    }
    /* Register eventHandlerFunc callback */
    if((apiResult == CY_BLE_SUCCESS) && (existFlag == 0u))
    {
        if(cy_ble_eventHandler.count < CY_BLE_MAX_SRVI)
        {
            cy_ble_eventHandler.serviceEventHandler[cy_ble_eventHandler.count] = eventHandlerFunc;
            cy_ble_eventHandler.count += 1u;
        }
        else
        {
            apiResult = CY_BLE_ERROR_MEMORY_ALLOCATION_FAILED;
        }
    }

    return(apiResult);
}

/******************************************************************************
* Function Name: Cy_BLE_InvokeServiceEventHandler
***************************************************************************//**
*
*  Invoke registered service event handlers.
*
*  \param eventCode:   The event code.
*  \param eventParam:  The event parameters.
*
* \return
*  Return value is of type cy_en_ble_gatt_err_code_t.
*
******************************************************************************/
cy_en_ble_gatt_err_code_t Cy_BLE_InvokeServiceEventHandler(uint32_t eventCode,
                                                           void *eventParam)
{
    uint32_t idx;
    cy_en_ble_gatt_err_code_t gattErr = CY_BLE_GATT_ERR_NONE;

    for(idx = 0u; (idx < cy_ble_eventHandler.count) && ((cy_ble_eventHandlerFlag & CY_BLE_CALLBACK) != 0u); idx++)
    {
        gattErr = cy_ble_eventHandler.serviceEventHandler[idx](eventCode, eventParam);
    }

    return(gattErr);
}
#endif /* CY_BLE_GAP_ROLE_PERIPHERAL || CY_BLE_GAP_ROLE_CENTRAL */

#if (CY_BLE_GATT_ROLE_SERVER)


/******************************************************************************
* Function Name: Cy_BLE_SendWriteResponse
***************************************************************************//**
*
*  Sends the Write Response to Write Request when event was handled by service.
*
*  \param eventParam - The event parameter.
*  \param gattErr - The error code.
*
* \return
*  None.
*
******************************************************************************/
static void Cy_BLE_SendWriteResponse(const cy_stc_ble_gatts_write_cmd_req_param_t *eventParam,
                                     cy_en_ble_gatt_err_code_t gattErr)
{
    /* Send response when event was handled by the service */
    if((cy_ble_eventHandlerFlag & CY_BLE_CALLBACK) == 0u)
    {
        if(gattErr != CY_BLE_GATT_ERR_NONE)
        {
            cy_stc_ble_gatt_err_param_t err_param =
            {
                .errInfo.opCode     = CY_BLE_GATT_WRITE_REQ,
                .errInfo.attrHandle = eventParam->handleValPair.attrHandle,
                .errInfo.errorCode  = gattErr,
                .connHandle         = eventParam->connHandle
            };
            /* Send an Error Response */
            (void)Cy_BLE_GATTS_ErrorRsp(&err_param);
        }
        else
        {
            (void)Cy_BLE_GATTS_WriteRsp(eventParam->connHandle);
        }
    }
}


#endif /* CY_BLE_GATT_ROLE_SERVER */



