ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble_event_handler.c
/******************************************************************************
* Function Name: Cy_BLE_TimeOutEventHandler
***************************************************************************//**
*
*  Handles a CY_BLE_EVT_TIMEOUT event from the BLE stack.
*
*  \param eventParam: The pointer to a structure of type cy_stc_ble_timeout_param_t.
*
* \return
*  None
*
******************************************************************************/
static void Cy_BLE_TimeOutEventHandler(const cy_stc_ble_timeout_param_t *eventParam)
{
    if(eventParam->reasonCode == CY_BLE_GATT_RSP_TO)
    {
    #if (CY_BLE_GATT_ROLE_CLIENT)
        {
            uint32_t discIdx = Cy_BLE_GetDiscoveryIdx(eventParam->CY_BLE_HANDLE.connHandle);
            if((discIdx < CY_BLE_CONFIG_GATTC_COUNT) && (cy_ble_discovery[discIdx].autoDiscoveryFlag != 0u))
            {
                switch(Cy_BLE_GetConnectionState(eventParam->CY_BLE_HANDLE.connHandle))
                {
                    case CY_BLE_CONN_STATE_CLIENT_SRVC_DISCOVERING:
                        Cy_BLE_ApplCallback((uint32_t)CY_BLE_EVT_GATTC_SRVC_DISCOVERY_FAILED,
                                            (cy_stc_ble_conn_handle_t*)&eventParam->CY_BLE_HANDLE.connHandle);
                        break;

                    case CY_BLE_CONN_STATE_CLIENT_INCL_DISCOVERING:
                        Cy_BLE_ApplCallback((uint32_t)CY_BLE_EVT_GATTC_INCL_DISCOVERY_FAILED,
                                            (cy_stc_ble_conn_handle_t*)&eventParam->CY_BLE_HANDLE.connHandle);
                        break;

                    case CY_BLE_CONN_STATE_CLIENT_CHAR_DISCOVERING:
                        Cy_BLE_ApplCallback((uint32_t)CY_BLE_EVT_GATTC_CHAR_DISCOVERY_FAILED,
                                            (cy_stc_ble_conn_handle_t*)&eventParam->CY_BLE_HANDLE.connHandle);
                        break;

                    case CY_BLE_CONN_STATE_CLIENT_DESCR_DISCOVERING:
                        Cy_BLE_ApplCallback((uint32_t)CY_BLE_EVT_GATTC_DESCR_DISCOVERY_FAILED,
                                            (cy_stc_ble_conn_handle_t*)&eventParam->CY_BLE_HANDLE.connHandle);
                        break;

                    default:        /* Other states should not be set in Auto discovery mode */
                        break;
                }
                cy_ble_discovery[discIdx].autoDiscoveryFlag = 0u;
                Cy_BLE_SetConnectionState(eventParam->CY_BLE_HANDLE.connHandle, CY_BLE_CONN_STATE_CONNECTED);
            }
        }
    #endif /* CY_BLE_GATT_ROLE_CLIENT */
    }

    #if (CY_BLE_GAP_ROLE_CENTRAL)
    /* Connection procedure timeout */
    if((eventParam->reasonCode == CY_BLE_GENERIC_APP_TO) &&
       (cy_ble_connectingTimeout.timerHandle == eventParam->timerHandle))
    {
        if(Cy_BLE_GetState() == CY_BLE_STATE_CONNECTING)
        {
            (void)Cy_BLE_GAPC_CancelDeviceConnection();
        }
    }
    #endif /* CY_BLE_GAP_ROLE_CENTRAL */
}


#if (CY_BLE_GATT_ROLE_SERVER || CY_BLE_GATT_ROLE_CLIENT)

/******************************************************************************
* Function Name: Cy_BLE_IsDeviceAddressValid
***************************************************************************//**
*
*  This function verifies that the BLE public address has been programmed to SFLASH
*  during manufacture. It can be used to verify if a public device address is
*  programmed to flash memory.
*
*  \param deviceAddress: The pointer to the BD address of type cy_stc_ble_gap_bd_addr_t.
*
* \return
*  A non-zero value when a device address differs from the default SFLASH content.
*
******************************************************************************/
uint8_t Cy_BLE_IsDeviceAddressValid(const cy_stc_ble_gap_bd_addr_t *deviceAddress)
{
    uint8_t addressValid = 0u;
    uint32_t i;

    if(deviceAddress->type == CY_BLE_GAP_ADDR_TYPE_PUBLIC)
    {
        for(i = 0u; i < CY_BLE_GAP_BD_ADDR_SIZE; i++)
        {
            if(deviceAddress->bdAddr[i] != 0u)
            {
                addressValid = 1u;
                break;
            }
        }
    }

    return(addressValid);
}
#endif /* CY_BLE_GATT_ROLE_SERVER || CY_BLE_GATT_ROLE_CLIENT */


/******************************************************************************
* Function Name: Cy_BLE_L2Cap_ConnParamUpdateRspHandler
***************************************************************************//**
*
*  Handles an L2CAP connection parameter response event from
*  the BLE stack.
*
*  \param eventParam:
*      * Accepted = 0x0000
*      * Rejected = 0x0001
*
* \return
*  None
*
******************************************************************************/
static void Cy_BLE_L2Cap_ConnParamUpdateRspEventHandler(const cy_stc_ble_l2cap_conn_update_rsp_param_t *eventParam)
{
    /* Unreferenced variable warning workaround */
    if(eventParam->result != 0u)
    {
    }
}


/******************************************************************************
* Function Name: Cy_BLE_GAP_ConnUpdateCompleteEventHandler
***************************************************************************//**
*
*  Handles a CY_BLE_EVT_GAP_CONNECTION_UPDATE_COMPLETE event from
*  the BLE stack.
*
*  \param eventParam: The pointer to the data structure specified by the event.
*
* \return
*  None
*
******************************************************************************/
static void Cy_BLE_GAP_ConnUpdateCompleteEventHandler(const cy_stc_ble_gap_conn_param_updated_in_controller_t *eventParam)
{
    /* Unreferenced variable warning workaround */
    if(eventParam != 0u)
    {
    }
}


/******************************************************************************
* Function Name: Cy_BLE_EventHandler
***************************************************************************//**
*
*  Handles events from the BLE stack.
*
*  \param event:   The event code.
*  \param evParam: The event parameters.
*
* \return
*  None.
*
******************************************************************************/
void Cy_BLE_EventHandler(cy_en_ble_event_t event,
                         void *evParam)
{
    cy_ble_eventHandlerFlag |= CY_BLE_CALLBACK;

    /* Common Profile event handling */
    switch(event)
    {
        /**********************************************************
         * General events
         ************************************************************/
        case CY_BLE_EVT_STACK_ON:

