ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble_event_handler.c
        #if (CY_BLE_GATT_ROLE_SERVER || CY_BLE_GATT_ROLE_CLIENT)
            {
                /* Set a device address  */
                if(Cy_BLE_IsDeviceAddressValid(cy_ble_sflashDeviceAddress) != 0u)
                {
                    (void)Cy_BLE_GAP_SetBdAddress(cy_ble_sflashDeviceAddress);
                #if (CY_BLE_GAP_ROLE_PERIPHERAL || CY_BLE_GAP_ROLE_BROADCASTER)
                    Cy_BLE_ChangeAdDeviceAddress(cy_ble_sflashDeviceAddress, 0u);
                    Cy_BLE_ChangeAdDeviceAddress(cy_ble_sflashDeviceAddress, 1u);
                #endif /* CY_BLE_GAP_ROLE_PERIPHERAL || CY_BLE_GAP_ROLE_BROADCASTER */
                }
                else
                {
                    if(cy_ble_configPtr->params->siliconDeviceAddressEnabled != 0u)
                    {
                        uint32_t bdAddrLoc;
                        bdAddrLoc = ((uint32_t)SFLASH->DIE_X & (uint32_t)CY_BLE_SFLASH_DIE_X_MASK) |
                                    ((uint32_t)(((uint32_t)SFLASH->DIE_Y) & ((uint32_t)CY_BLE_SFLASH_DIE_Y_MASK)) <<
                                     CY_BLE_SFLASH_DIE_X_BITS) |
                                    ((uint32_t)(((uint32_t)SFLASH->DIE_WAFER) & ((uint32_t)CY_BLE_SFLASH_DIE_WAFER_MASK)) <<
                                     CY_BLE_SFLASH_DIE_XY_BITS) |
                                    ((uint32_t)(((uint32_t)SFLASH->DIE_LOT[0]) & ((uint32_t)CY_BLE_SFLASH_DIE_LOT_MASK)) <<
                                     CY_BLE_SFLASH_DIE_XYWAFER_BITS);

                        cy_ble_configPtr->deviceAddress->bdAddr[0] = (uint8_t)bdAddrLoc;
                        cy_ble_configPtr->deviceAddress->bdAddr[1] = (uint8_t)(bdAddrLoc >> 8u);
                        cy_ble_configPtr->deviceAddress->bdAddr[2] = (uint8_t)(bdAddrLoc >> 16u);
                    }
                    (void)Cy_BLE_GAP_SetBdAddress(cy_ble_configPtr->deviceAddress);

                #if (CY_BLE_GAP_ROLE_PERIPHERAL || CY_BLE_GAP_ROLE_BROADCASTER)
                    Cy_BLE_ChangeAdDeviceAddress(cy_ble_configPtr->deviceAddress, 0u);
                    Cy_BLE_ChangeAdDeviceAddress(cy_ble_configPtr->deviceAddress, 1u);
                #endif /* CY_BLE_GAP_ROLE_PERIPHERAL || CY_BLE_GAP_ROLE_BROADCASTER */
                }
                /* Set the device IO Capability  */
                (void)Cy_BLE_GAP_SetIoCap((cy_en_ble_gap_iocap_t*)&cy_ble_configPtr->params->securityIoCapability);
                {
                    /* Enable all 4.1 events and configured 4.2 events */
                    uint8_t leMask[CY_BLE_LE_MASK_LENGTH] = { CY_LO8(CY_BLE_LE_MASK),
                                                              CY_HI8(CY_BLE_LE_MASK),0u,  0u, 0u, 0u, 0u, 0u };
                    (void)Cy_BLE_SetLeEventMask(leMask);
                }
            }
        #endif /* CY_BLE_GATT_ROLE_SERVER || CY_BLE_GATT_ROLE_CLIENT */
            Cy_BLE_SetState(CY_BLE_STATE_ON);
            break;

        case CY_BLE_EVT_STACK_SHUTDOWN_COMPLETE:
            Cy_BLE_SetState(CY_BLE_STATE_STOPPED);

            #if (CY_BLE_GAP_ROLE_PERIPHERAL || CY_BLE_GAP_ROLE_BROADCASTER)
            Cy_BLE_SetAdvertisementState(CY_BLE_ADV_STATE_STOPPED);
            #endif  /* (CY_BLE_GAP_ROLE_PERIPHERAL || CY_BLE_GAP_ROLE_BROADCASTER) */

            #if (CY_BLE_GAP_ROLE_CENTRAL || CY_BLE_GAP_ROLE_OBSERVER)
            Cy_BLE_SetScanState(CY_BLE_SCAN_STATE_STOPPED);
            #endif /* (CY_BLE_GAP_ROLE_CENTRAL || CY_BLE_GAP_ROLE_OBSERVER) */
            
            /* Adding a delay of 10ms to ensure that the controller is completely 
             * shut-down before generating the event to the application.
             * Controller generates CY_BLE_EVT_STACK_SHUTDOWN_COMPLETE event immediately 
             * after accepting the shut-down command (before resetting the controller), 
             * once this behaviour is fixed, this delay will no longer be required 
             */
            #if(CY_BLE_STACK_MODE_HOST_IPC)
                Cy_SysLib_Delay(10u);
            #endif /* CY_BLE_STACK_MODE_HOST_IPC */   
            
            /* Unregister BLE callback for Deepsleep/Sleep */
            Cy_BLE_UnregisterHostPMCallbacks();
            break;

        case CY_BLE_EVT_LE_SET_EVENT_MASK_COMPLETE:
        #if (CY_BLE_MODE_PROFILE)
            {
                if((cy_ble_cmdStatus & CY_BLE_STATUS_SET_TX_PWR_LVL) == 0u)
                {
                    cy_stc_ble_tx_pwr_lvl_info_t bleSsPowerLevel = { .pwrConfigParam.bdHandle = 0x0u };

                    /* Set the Tx Power Level for advertising and connection channels */
                    bleSsPowerLevel.blePwrLevel = cy_ble_configPtr->params->txPowerLevelAdv;
                    bleSsPowerLevel.pwrConfigParam.bleSsChId = CY_BLE_LL_ADV_CH_TYPE;
                    (void)Cy_BLE_SetTxPowerLevel(&bleSsPowerLevel);

                    bleSsPowerLevel.blePwrLevel = cy_ble_configPtr->params->txPowerLevelConn;
                    bleSsPowerLevel.pwrConfigParam.bleSsChId = CY_BLE_LL_CONN_CH_TYPE;
                    bleSsPowerLevel.pwrConfigParam.bdHandle = 0xFFu; /* Set the tx power level value for all connection handles.*/
                    (void)Cy_BLE_SetTxPowerLevel(&bleSsPowerLevel);
                    
                    /* Set flag that executed Cy_BLE_SetTxPowerLevel during componnent start-up  */
                    cy_ble_cmdStatus |= CY_BLE_STATUS_SET_TX_PWR_LVL;
                }
            }
        #endif /* CY_BLE_MODE_PROFILE */
            break;
            
        case CY_BLE_EVT_TIMEOUT:
            Cy_BLE_TimeOutEventHandler((cy_stc_ble_timeout_param_t*)evParam);
            #if (CY_BLE_GAP_ROLE_PERIPHERAL || CY_BLE_GAP_ROLE_CENTRAL)
            (void)Cy_BLE_InvokeServiceEventHandler((uint32_t)event, (void*)evParam);
            #endif /*(CY_BLE_GAP_ROLE_PERIPHERAL || CY_BLE_GAP_ROLE_CENTRAL)*/
            break;

        case CY_BLE_EVT_STACK_BUSY_STATUS:
            #if (CY_BLE_GAP_ROLE_PERIPHERAL || CY_BLE_GAP_ROLE_CENTRAL)
            cy_ble_busyStatus[Cy_BLE_GetConnHandleByBdHandle(((cy_stc_ble_l2cap_state_info_t*)evParam)->bdHandle).attId] =
                ((cy_stc_ble_l2cap_state_info_t*)evParam)->flowState;
            #endif /*(CY_BLE_GAP_ROLE_PERIPHERAL || CY_BLE_GAP_ROLE_CENTRAL)*/
            break;

        case CY_BLE_EVT_MEMORY_REQUEST:
        #if (CY_BLE_MODE_PROFILE)
            {
                cy_stc_ble_memory_request_t *memReq = (cy_stc_ble_memory_request_t*)evParam;
                if(memReq->request == CY_BLE_PREPARED_WRITE_REQUEST)
                {
            #if (CY_BLE_GATT_ENABLE_EXTERNAL_PREP_WRITE_BUFF == 0u)
                    /* Stack requests to provide memory to process a remote request */
                    if(memReq->allocFree == CY_BLE_ALLOC_MEMORY)
                    {
                        static cy_stc_ble_prepare_write_request_memory_t gPrepWriteReqMem;

                        /* Configure and return a statically allocated buffer at the end of the cy_ble_stackMemoryRam buffer */
                        gPrepWriteReqMem.prepareWriteQueueSize = CY_BLE_GATT_MAX_PREPARE_BUFF_COUNT;
                        gPrepWriteReqMem.totalAttrValueLength = CY_BLE_GATT_PREPARE_LENGTH_ALIGN;
                        gPrepWriteReqMem.queueBuffer = &cy_ble_stackMemoryRam[CY_BLE_STACK_RAM_SIZE -
                                                                              CY_BLE_GATT_PREPARE_WRITE_BUFF_LEN];
                        memReq->configMemory = &gPrepWriteReqMem;
                    }
                    /* Clear the CY_BLE_CALLBACK flag not to provide a handled event to the application */
                    cy_ble_eventHandlerFlag &= (uint8_t) ~CY_BLE_CALLBACK;
            #endif  /* CY_BLE_GATT_ENABLE_EXTERNAL_PREP_WRITE_BUFF == 0u */
                }
            }
        #endif /* CY_BLE_MODE_PROFILE */
            break;

        /**********************************************************
         * GAP events
         ************************************************************/
        case CY_BLE_EVT_GAP_AUTH_REQ:
            break;

        case CY_BLE_EVT_GAP_AUTH_COMPLETE:
        #if ((CY_BLE_GAP_ROLE_PERIPHERAL || CY_BLE_GAP_ROLE_CENTRAL) && (CY_BLE_BONDING_REQUIREMENT == CY_BLE_BONDING_YES))
            {
                cy_stc_ble_conn_handle_t connectedHandle;
                connectedHandle = Cy_BLE_GetConnHandleByBdHandle(((cy_stc_ble_gap_auth_info_t*)evParam)->bdHandle);
                cy_ble_peerBonding[connectedHandle.attId] = ((cy_stc_ble_gap_auth_info_t*)evParam)->bonding;
            }
        #endif  /* CY_BLE_BONDING_REQUIREMENT == CY_BLE_BONDING_YES */
            break;

        case CY_BLE_EVT_GAP_CONNECTION_UPDATE_COMPLETE:
            Cy_BLE_GAP_ConnUpdateCompleteEventHandler((const cy_stc_ble_gap_conn_param_updated_in_controller_t*)evParam);
            #if (CY_BLE_GAP_ROLE_PERIPHERAL || CY_BLE_GAP_ROLE_CENTRAL)
            (void)Cy_BLE_InvokeServiceEventHandler((uint32_t)event, (void*)evParam);
            #endif /*(CY_BLE_GAP_ROLE_PERIPHERAL || CY_BLE_GAP_ROLE_CENTRAL) */
            break;

    #if (CY_BLE_LL_PRIVACY_FEATURE != 0u)
        case CY_BLE_EVT_GAP_ENHANCE_CONN_COMPLETE:
        {
            cy_stc_ble_gap_conn_param_updated_in_controller_t connCParam;
            cy_stc_ble_gap_enhance_conn_complete_param_t *connEnhanceParam;

            connEnhanceParam = (cy_stc_ble_gap_enhance_conn_complete_param_t*)evParam;
            connCParam.status = connEnhanceParam->status;
            connCParam.connIntv = connEnhanceParam->connIntv;
            connCParam.connLatency = connEnhanceParam->connLatency;
            connCParam.supervisionTO = connEnhanceParam->supervisionTo;
            Cy_BLE_GAP_ConnUpdateCompleteEventHandler((const cy_stc_ble_gap_conn_param_updated_in_controller_t*)&connCParam);

