ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble_event_handler.c
            /* Advertising is automatically stopped if a Slave is connected, so update the adv state to
             *  CY_BLE_ADV_STATE_STOPPED  */
            #if (CY_BLE_GAP_ROLE_PERIPHERAL || CY_BLE_GAP_ROLE_BROADCASTER)
            if(connEnhanceParam->role == (uint8_t)CY_BLE_GAP_LL_ROLE_SLAVE)
            {
                Cy_BLE_SetAdvertisementState(CY_BLE_ADV_STATE_STOPPED);
            }
            #endif  /* (CY_BLE_GAP_ROLE_PERIPHERAL || CY_BLE_GAP_ROLE_BROADCASTER) */
        }
    #else
        case CY_BLE_EVT_GAP_DEVICE_CONNECTED:
            Cy_BLE_GAP_ConnUpdateCompleteEventHandler((const cy_stc_ble_gap_conn_param_updated_in_controller_t*)evParam);

            /* Advertising is automatically stopped if a Slave is connected, so update the adv state to CY_BLE_ADV_STATE_STOPPED  */
            #if (CY_BLE_GAP_ROLE_PERIPHERAL || CY_BLE_GAP_ROLE_BROADCASTER)
            if(((cy_stc_ble_gap_connected_param_t*)evParam)->role == CY_BLE_GAP_LL_ROLE_SLAVE)
            {
                Cy_BLE_SetAdvertisementState(CY_BLE_ADV_STATE_STOPPED);
            }
            #endif /* (CY_BLE_GAP_ROLE_PERIPHERAL || CY_BLE_GAP_ROLE_BROADCASTER) */
    #endif         /* CY_BLE_LL_PRIVACY_FEATURE != 0u */
            #if (CY_BLE_GAP_ROLE_CENTRAL)
            if(cy_ble_connectingTimeout.timeout != 0u)
            {
                (void)Cy_BLE_StopTimer(&cy_ble_connectingTimeout);
            }
            #endif /* CY_BLE_GAP_ROLE_CENTRAL */
            Cy_BLE_SetState(CY_BLE_STATE_ON);
            break;

        case CY_BLE_EVT_GAP_DEVICE_DISCONNECTED:
            Cy_BLE_SetState(CY_BLE_STATE_ON);
            break;

        #if (CY_BLE_GAP_ROLE_PERIPHERAL || CY_BLE_GAP_ROLE_BROADCASTER)
        case CY_BLE_EVT_GAPP_ADVERTISEMENT_START_STOP:
            #if (CY_BLE_GAP_ROLE_PERIPHERAL || CY_BLE_GAP_ROLE_CENTRAL)
            (void)Cy_BLE_InvokeServiceEventHandler((uint32_t)event, (void*)evParam);
            #endif /* (CY_BLE_GAP_ROLE_PERIPHERAL || CY_BLE_GAP_ROLE_CENTRAL) */

            if((cy_ble_eventHandlerFlag & CY_BLE_CALLBACK) != 0u)
            {
                /* After Cy_BLE_GAPP_StartAdvertisement, the first event indicates that advertising has started */
                if(Cy_BLE_GetAdvertisementState() == CY_BLE_ADV_STATE_ADV_INITIATED)
                {
                    Cy_BLE_SetAdvertisementState(CY_BLE_ADV_STATE_ADVERTISING);
                }
                /* When the application initiated a stop advertisement */
                else if(Cy_BLE_GetAdvertisementState() == CY_BLE_ADV_STATE_STOP_INITIATED)
                {
                    Cy_BLE_SetAdvertisementState(CY_BLE_ADV_STATE_STOPPED);
                }
                else /* The following event indicates that advertising has been stopped */
                {
                    if(Cy_BLE_GetAdvertisementState() == CY_BLE_ADV_STATE_ADVERTISING)
                    {
                        Cy_BLE_SetAdvertisementState(CY_BLE_ADV_STATE_STOPPED);
                        if((cy_ble_configPtr->gappAdvParams[cy_ble_advIndex].slowAdvEnable != 0u) &&
                           (cy_ble_configPtr->gappAdvParams[cy_ble_advIndex].fastAdvTimeOut != 0u))
                        {
                            if(cy_ble_advertisingIntervalType == CY_BLE_ADVERTISING_FAST)
                            {
                                /* When fast advertising time out occur: Start slow advertising */
                                if(Cy_BLE_GAPP_StartAdvertisement(CY_BLE_ADVERTISING_SLOW, cy_ble_advIndex) ==
                                   CY_BLE_SUCCESS)
                                {
                                    Cy_BLE_SetAdvertisementState(CY_BLE_ADV_STATE_ADV_INITIATED);
                                }
                            }
                        }
                    }
                }
            }
            break;
        #endif /* CY_BLE_GAP_ROLE_PERIPHERAL || CY_BLE_GAP_ROLE_BROADCASTER */

        #if (CY_BLE_GAP_ROLE_CENTRAL || CY_BLE_GAP_ROLE_OBSERVER)
        case CY_BLE_EVT_GAPC_SCAN_START_STOP:
            #if (CY_BLE_GAP_ROLE_CENTRAL)
            (void)Cy_BLE_InvokeServiceEventHandler((uint32_t)event, (void*)evParam);
            #endif /* (CY_BLE_GAP_ROLE_CENTRAL) */

            if((cy_ble_eventHandlerFlag & CY_BLE_CALLBACK) != 0u)
            {
                /* After Cy_BLE_GAPC_StartScan, the first event indicates that scanning has been started */
                if(Cy_BLE_GetScanState() == CY_BLE_SCAN_STATE_SCAN_INITIATED)
                {
                    Cy_BLE_SetScanState(CY_BLE_SCAN_STATE_SCANNING);
                }
                /* When the application initiated stop scanning */
                else if(Cy_BLE_GetScanState() == CY_BLE_SCAN_STATE_STOP_INITIATED)
                {
                    Cy_BLE_SetScanState(CY_BLE_SCAN_STATE_STOPPED);
                }
                else /* The following event indicates that scanning has been stopped by stack */
                {
                    if(Cy_BLE_GetScanState() == CY_BLE_SCAN_STATE_SCANNING)
                    {
                        Cy_BLE_SetScanState(CY_BLE_SCAN_STATE_STOPPED);
                        if((cy_ble_configPtr->gapcScanParams[cy_ble_scanIndex].slowScanEnabled != 0u) &&
                           (cy_ble_configPtr->gapcScanParams[cy_ble_scanIndex].fastScanTimeOut != 0u))
                        {
                            if(cy_ble_scanningIntervalType == CY_BLE_SCANNING_FAST)
                            {
                                /* When a fast scanning timeout occurs: Start slow scanning */
                                if(Cy_BLE_GAPC_StartScan(CY_BLE_SCANNING_SLOW, cy_ble_scanIndex) == CY_BLE_SUCCESS)
                                {
                                    Cy_BLE_SetScanState(CY_BLE_SCAN_STATE_SCAN_INITIATED);
                                }
                            }
                        }
                    }
                }
            }
            break;
        #endif /* CY_BLE_GAP_ROLE_CENTRAL || CY_BLE_GAP_ROLE_OBSERVER */

        /**********************************************************
         * L2AP events
         ************************************************************/
        case CY_BLE_EVT_L2CAP_CONN_PARAM_UPDATE_RSP:
            Cy_BLE_L2Cap_ConnParamUpdateRspEventHandler((cy_stc_ble_l2cap_conn_update_rsp_param_t*)evParam);

            #if (CY_BLE_GAP_ROLE_PERIPHERAL || CY_BLE_GAP_ROLE_CENTRAL)
            (void)Cy_BLE_InvokeServiceEventHandler((uint32_t)event, (void*)evParam);
            #endif /* (CY_BLE_GAP_ROLE_PERIPHERAL || CY_BLE_GAP_ROLE_CENTRAL) */
            break;

            /**********************************************************
             * GATT events
             ************************************************************/
        #if ((CY_BLE_GATT_ROLE_SERVER) || (CY_BLE_GATT_ROLE_CLIENT))
        case CY_BLE_EVT_GATT_CONNECT_IND:
        #if (CY_BLE_GATT_ROLE_CLIENT)
            /* If connected to the same device which is already discovered */
            if((Cy_BLE_GetConnectionState(*(cy_stc_ble_conn_handle_t*)evParam) ==
                CY_BLE_CONN_STATE_CLIENT_DISCONNECTED_DISCOVERED) &&
               (((cy_stc_ble_conn_handle_t*)evParam)->bdHandle ==
                cy_ble_connHandle[((cy_stc_ble_conn_handle_t*)evParam)->attId].bdHandle))
            {   /* Set a discovered state */
                Cy_BLE_SetConnectionState(*(cy_stc_ble_conn_handle_t*)evParam, CY_BLE_CONN_STATE_CLIENT_DISCOVERED);
            }
            else    /* Connected to a new device */
        #endif /* CY_BLE_GATT_ROLE_CLIENT */
            {
                /* Clear the discovery index for the Client role */
                #if (CY_BLE_GATT_ROLE_CLIENT)
                (void)Cy_BLE_GATTC_RemoveConnHandle(*(cy_stc_ble_conn_handle_t*)evParam);
                #endif /* CY_BLE_GATT_ROLE_CLIENT */
                Cy_BLE_SetConnectionState(*(cy_stc_ble_conn_handle_t*)evParam, CY_BLE_CONN_STATE_CONNECTED);
                cy_ble_connHandle[((cy_stc_ble_conn_handle_t*)evParam)->attId] = *(cy_stc_ble_conn_handle_t*)evParam;
            }

            cy_ble_busyStatus[((cy_stc_ble_conn_handle_t*)evParam)->attId] = CY_BLE_STACK_STATE_FREE;

        #if ((CY_BLE_GATT_ROLE_SERVER) && (CY_BLE_GATT_DB_CCCD_COUNT != 0u) && \
            (CY_BLE_BONDING_REQUIREMENT == CY_BLE_BONDING_YES))
            
            /* Initialize the CCCD values in the RAM when bonding is enabled */
            (void)memcpy((uint8_t*)cy_ble_attValuesCccdMultiple[((cy_stc_ble_conn_handle_t*)evParam)->attId],
                         cy_ble_configPtr->flashStorage->attValuesCCCDFlashMemory[((cy_stc_ble_conn_handle_t*)evParam)->
                                                                                   bdHandle],
                         CY_BLE_GATT_DB_CCCD_COUNT + CY_BLE_CCCD_CRC_BYTE);

            /* Check CRC for CCCD data */
            {
                uint8_t cccdCrc = Cy_BLE_HAL_CalcCRC8(cy_ble_attValuesCccdMultiple[((cy_stc_ble_conn_handle_t*)evParam)->attId], 
                                                      CY_BLE_GATT_DB_CCCD_COUNT);

                if(cy_ble_attValuesCccdMultiple[((cy_stc_ble_conn_handle_t*)evParam)->attId][CY_BLE_GATT_DB_CCCD_COUNT] != cccdCrc)
                {
                    /* Inform that the CRC for CCCD is wrong */
                    Cy_BLE_ApplCallback((uint32_t)CY_BLE_EVT_GATTS_EVT_CCCD_CORRUPT, NULL);
                    
                    /* Clean the CCCD buffer in the RAM */
                    (void)memset((uint8_t*)cy_ble_attValuesCccdMultiple[((cy_stc_ble_conn_handle_t*)evParam)->attId],
                                  0, CY_BLE_GATT_DB_CCCD_COUNT + CY_BLE_CCCD_CRC_BYTE);
                }            
            }
           
