ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble_event_handler.c
        #endif /* CY_BLE_GATT_ROLE_SERVER && (CY_BLE_BONDING_REQUIREMENT == CY_BLE_BONDING_YES) */

            (void)Cy_BLE_InvokeServiceEventHandler((uint32_t)event, (void*)evParam);
            break;

        case CY_BLE_EVT_GATT_DISCONNECT_IND:
        #if (CY_BLE_GATT_ROLE_CLIENT)
            if((Cy_BLE_GetConnectionState(*(cy_stc_ble_conn_handle_t*)evParam) == CY_BLE_CONN_STATE_CLIENT_DISCOVERED) &&
               (CY_BLE_BONDING_REQUIREMENT == CY_BLE_BONDING_YES))
            {
                Cy_BLE_SetConnectionState(*(cy_stc_ble_conn_handle_t*)evParam,
                                          CY_BLE_CONN_STATE_CLIENT_DISCONNECTED_DISCOVERED);
            }
            else
        #endif /* CY_BLE_GATT_ROLE_CLIENT */
            {
                Cy_BLE_SetConnectionState(*(cy_stc_ble_conn_handle_t*)evParam, CY_BLE_CONN_STATE_DISCONNECTED);
            #if (CY_BLE_GATT_ROLE_CLIENT)
                (void)Cy_BLE_GATTC_RemoveConnHandle(*(cy_stc_ble_conn_handle_t*)evParam);
            #endif /* CY_BLE_GATT_ROLE_CLIENT */
            }

            (void)Cy_BLE_InvokeServiceEventHandler((uint32_t)event, (void*)evParam);
            break;

        case CY_BLE_EVT_GATTS_XCNHG_MTU_REQ:
        {
            cy_stc_ble_gatt_xchg_mtu_param_t mtuParam;
            mtuParam.connHandle = ((cy_stc_ble_gatt_xchg_mtu_param_t*)evParam)->connHandle;

            if(CY_BLE_GATT_MTU > ((cy_stc_ble_gatt_xchg_mtu_param_t*)evParam)->mtu)
            {
                mtuParam.mtu = ((cy_stc_ble_gatt_xchg_mtu_param_t*)evParam)->mtu;
            }
            else
            {
                mtuParam.mtu = CY_BLE_GATT_MTU;
            }
            (void)Cy_BLE_GATTS_ExchangeMtuRsp(&mtuParam);
        }
        break;
    #endif /* CY_BLE_GATT_ROLE_SERVER || CY_BLE_GATT_ROLE_CLIENT */

    #if (CY_BLE_GATT_ROLE_CLIENT)
        case CY_BLE_EVT_GAPC_SCAN_PROGRESS_RESULT:
            (void)Cy_BLE_InvokeServiceEventHandler((uint32_t)event, (void*)evParam);
            break;
    #endif /* CY_BLE_GATT_ROLE_CLIENT */

    #if (CY_BLE_GATT_ROLE_SERVER)
        case CY_BLE_EVT_GATTS_WRITE_REQ:
        {
            cy_en_ble_gatt_err_code_t gattErr;
            gattErr = Cy_BLE_GATTS_WriteEventHandler((cy_stc_ble_gatts_write_cmd_req_param_t*)evParam);
            if(gattErr == CY_BLE_GATT_ERR_NONE)
            {
                gattErr = Cy_BLE_InvokeServiceEventHandler((uint32_t)event, (void*)evParam);
            }
            Cy_BLE_SendWriteResponse((cy_stc_ble_gatts_write_cmd_req_param_t*)evParam, gattErr);
        }
        break;

        case CY_BLE_EVT_GATTS_WRITE_CMD_REQ:
            (void)Cy_BLE_InvokeServiceEventHandler((uint32_t)event, (void*)evParam);
            break;

        case CY_BLE_EVT_GATTS_PREP_WRITE_REQ:
            (void)Cy_BLE_InvokeServiceEventHandler((uint32_t)event, (void*)evParam);
            break;

        case CY_BLE_EVT_GATTS_EXEC_WRITE_REQ:
            (void)Cy_BLE_InvokeServiceEventHandler((uint32_t)event, (void*)evParam);
            break;

        case CY_BLE_EVT_GATTS_HANDLE_VALUE_CNF:
            (void)Cy_BLE_InvokeServiceEventHandler((uint32_t)event, (void*)evParam);
            break;

        case CY_BLE_EVT_GATTS_READ_CHAR_VAL_ACCESS_REQ:
        #if (CY_BLE_GATT_DB_CCCD_COUNT != 0u)
            (void)Cy_BLE_GATTS_ReadAttributeValueCCCDReqHandler((cy_stc_ble_gatts_char_val_read_req_t*)evParam);
        #endif  /* (CY_BLE_GATT_DB_CCCD_COUNT != 0u) */
            (void)Cy_BLE_InvokeServiceEventHandler((uint32_t)event, (void*)evParam);
            break;
    #endif /* CY_BLE_GATT_ROLE_SERVER */

    #if (CY_BLE_GATT_ROLE_CLIENT)
        case CY_BLE_EVT_GATTC_READ_BY_GROUP_TYPE_RSP:
            Cy_BLE_ReadByGroupEventHandler((cy_stc_ble_gattc_read_by_grp_rsp_param_t*)evParam);
            break;

        case CY_BLE_EVT_GATTC_READ_BY_TYPE_RSP:
            Cy_BLE_ReadByTypeEventHandler((cy_stc_ble_gattc_read_by_type_rsp_param_t*)evParam);
            break;

        case CY_BLE_EVT_GATTC_READ_BLOB_RSP:
            (void)Cy_BLE_InvokeServiceEventHandler((uint32_t)event, (void*)evParam);
            break;

        case CY_BLE_EVT_GATTC_LONG_PROCEDURE_END:
            Cy_BLE_LongProcedureEndEventHandler(((cy_stc_ble_gattc_long_procedure_end_param_t*)evParam)->connHandle);
            break;

        case CY_BLE_EVT_GATTC_FIND_INFO_RSP:
            Cy_BLE_FindInfoEventHandler((cy_stc_ble_gattc_find_info_rsp_param_t*)evParam);
            break;

        case CY_BLE_EVT_GATTC_ERROR_RSP:
            Cy_BLE_ErrorResponseEventHandler((cy_stc_ble_gatt_err_param_t*)evParam);
            (void)Cy_BLE_InvokeServiceEventHandler((uint32_t)event, (void*)evParam);
            break;

        case CY_BLE_EVT_GATTC_HANDLE_VALUE_NTF:
            (void)Cy_BLE_InvokeServiceEventHandler((uint32_t)event, (void*)evParam);
            break;

        case CY_BLE_EVT_GATTC_HANDLE_VALUE_IND:
            Cy_BLE_GATTC_IndicationEventHandler((cy_stc_ble_gattc_handle_value_ind_param_t*)evParam);
            (void)Cy_BLE_InvokeServiceEventHandler((uint32_t)event, (void*)evParam);

            /* Respond with a Handle Value Confirmation when request handled */
            if((cy_ble_eventHandlerFlag & CY_BLE_CALLBACK) == 0u)
            {
                cy_stc_ble_gattc_confirmation_req_t confirmationParam;
                confirmationParam.connHandle = ((cy_stc_ble_gattc_handle_value_ind_param_t*)evParam)->connHandle;

                (void)Cy_BLE_GATTC_Confirmation(&confirmationParam);
            }
            break;

        case CY_BLE_EVT_GATTC_READ_RSP:
            (void)Cy_BLE_InvokeServiceEventHandler((uint32_t)event, (void*)evParam);
            break;

        case CY_BLE_EVT_GATTC_READ_MULTI_RSP:
            (void)Cy_BLE_InvokeServiceEventHandler((uint32_t)event, (void*)evParam);
            break;

        case CY_BLE_EVT_GATTC_WRITE_RSP:
            (void)Cy_BLE_InvokeServiceEventHandler((uint32_t)event, (void*)evParam);
            break;

        case CY_BLE_EVT_GATTC_EXEC_WRITE_RSP:
            (void)Cy_BLE_InvokeServiceEventHandler((uint32_t)event, (void*)evParam);
            break;
    #endif /* CY_BLE_GATT_ROLE_CLIENT */

