ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble_event_handler.c
    #if ((CY_BLE_GAP_ROLE_PERIPHERAL || CY_BLE_GAP_ROLE_CENTRAL) && (CY_BLE_BONDING_REQUIREMENT == CY_BLE_BONDING_YES))
        case CY_BLE_EVT_PENDING_FLASH_WRITE:
            cy_ble_pendingFlashWrite |= CY_BLE_PENDING_STACK_FLASH_WRITE_BIT;
            break;
    #endif  /* (CY_BLE_BONDING_REQUIREMENT == CY_BLE_BONDING_YES) */

        default:
            break;
    }

    if((cy_ble_eventHandlerFlag & (CY_BLE_CALLBACK | CY_BLE_ENABLE_ALL_EVENTS)) != 0u)
    {
        cy_ble_eventHandlerFlag &= (uint8_t) ~CY_BLE_CALLBACK;
        Cy_BLE_ApplCallback((uint32_t)event, evParam);
    }
}

#if (CY_BLE_GATT_ROLE_CLIENT)

/******************************************************************************
* Function Name: Cy_BLE_ReadByGroupEventHandler
***************************************************************************//**
*
*  Handles a Read By Group Response event during an automatic server discovery
*  process.
*
*  \param eventParam: The event parameters for a Read By Group Response.
*
* \return
*  None
*
******************************************************************************/
void Cy_BLE_ReadByGroupEventHandler(cy_stc_ble_gattc_read_by_grp_rsp_param_t *eventParam)
{
    cy_stc_ble_disc_srv_info_t locDiscServInfo = { .connHandle = eventParam->connHandle };
    uint32_t discIdx = Cy_BLE_GetDiscoveryIdx(eventParam->connHandle);
    uint16_t locDataLength;
    uint16_t attrLength;
    uint32_t fFlag;
    uint32_t j;
    uint32_t i;

    if((Cy_BLE_GetConnectionState(eventParam->connHandle) == CY_BLE_CONN_STATE_CLIENT_SRVC_DISCOVERING) &&
       (discIdx < CY_BLE_CONFIG_GATTC_COUNT) && (cy_ble_discovery[discIdx].autoDiscoveryFlag != 0u))
    {
        locDataLength = eventParam->attrData.length;

        if((locDataLength == CY_BLE_DISC_SRVC_INFO_LEN) || (locDataLength == CY_BLE_DISC_SRVC_INFO_128_LEN))
        {
            attrLength = eventParam->attrData.attrLen;

            for(i = 0u; i < attrLength; i += locDataLength)
            {
                cy_ble_eventHandlerFlag |= CY_BLE_CALLBACK;

                locDiscServInfo.srvcInfo = (cy_stc_ble_disc_srvc128_info_t*)(eventParam->attrData.attrValue + i);
                fFlag = 0u;

                /* Received a 16-bit service UUID */
                if((locDiscServInfo.srvcInfo->range.startHandle >=
                    cy_ble_discovery[discIdx].gattcDiscoveryRange.startHandle) &&
                   (locDiscServInfo.srvcInfo->range.startHandle <=
                    cy_ble_discovery[discIdx].gattcDiscoveryRange.endHandle))
                {
                    if(locDataLength == CY_BLE_DISC_SRVC_INFO_LEN)
                    {
                        for(j = 0u; (j < (uint32_t)CY_BLE_SRVI_COUNT) && (fFlag == 0u); j++)
                        {
                            locDiscServInfo.uuidFormat = CY_BLE_GATT_16_BIT_UUID_FORMAT;
                            if(cy_ble_serverInfo[discIdx][j].uuid == locDiscServInfo.srvcInfo->uuid.uuid16)
                            {
                                if(cy_ble_serverInfo[discIdx][j].range.startHandle ==
                                   CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE)
                                {
                                    cy_ble_serverInfo[discIdx][j].range = locDiscServInfo.srvcInfo->range;
                                    fFlag = 1u;
                                }
                                else    /* Duplication of service */
                                {
                                    /* For multiple service support next service has the same UUID */
                                    if((j >= (CY_BLE_SRVI_COUNT - 1u)) ||
                                       (cy_ble_serverInfo[discIdx][j + 1u].uuid != locDiscServInfo.srvcInfo->uuid.uuid16))
                                    {
                                        Cy_BLE_ApplCallback((uint32_t)CY_BLE_EVT_GATTC_SRVC_DUPLICATION, &locDiscServInfo);
                                        fFlag = 1u;
                                    }
                                }
                            }
                        }
                    }
                    else  /* Received a 128-bit service UUID */
                    {
                        locDiscServInfo.uuidFormat = CY_BLE_GATT_128_BIT_UUID_FORMAT;
                        
                        /* Loop thru all registered services and invoke CY_BLE_EVT_GATTC_DISC_CHAR event */
                        (void)Cy_BLE_InvokeServiceEventHandler((uint32_t)CY_BLE_EVT_GATTC_DISC_SERVICE,
                                                               (void*)&locDiscServInfo);
                    }
                }
                
                /* Generate event CY_BLE_EVT_GATTC_DISC_SKIPPED_SERVICE, if the incoming service was not processed */
                if((fFlag == 0u) && ((cy_ble_eventHandlerFlag & CY_BLE_CALLBACK) != 0u))
                {
                    /* Inform application that we discovered the service which is not defined in GATT database */
                    Cy_BLE_ApplCallback((uint32_t)CY_BLE_EVT_GATTC_DISC_SKIPPED_SERVICE, &locDiscServInfo);    
                }
                
            }
            cy_ble_eventHandlerFlag &= (uint8_t) ~CY_BLE_CALLBACK;
        }
        else
        {
            Cy_BLE_ApplCallback((uint32_t)CY_BLE_EVT_GATTC_SRVC_DISCOVERY_FAILED, &eventParam->connHandle);
        }
    }
}


/******************************************************************************
* Function Name: Cy_BLE_NextInclDiscovery
***************************************************************************//**
*
*  Looks for the included services in the current service (pointed by
*   cy_ble_disCount). If the current service handle range is invalid (any of start
*   or end handle is invalid), then increments the cy_ble_disCount and check
*   the next service range and does so until a valid range is caught or the end of
*   the service set is reached.
*
*  \param connHandle:     The connection handle.
*  \param incrementIndex: A non-zero value indicates that the service index should be
*                         incremented.
*
* \return
*  None.
*
******************************************************************************/
void Cy_BLE_NextInclDiscovery(cy_stc_ble_conn_handle_t connHandle,
                              uint8_t incrementIndex)
{
    uint32_t discIdx = Cy_BLE_GetDiscoveryIdx(connHandle);

    if(incrementIndex != CY_BLE_DISCOVERY_INIT)
    {
        cy_ble_discovery[discIdx].servCount++;
    }
    else
    {
        cy_ble_discovery[discIdx].servCount = 0u;
        cy_ble_discovery[discIdx].inclInfo.inclDefHandle = 0u;
    }

    /* Skip not existing services and services out of the discovery range */
    while((cy_ble_discovery[discIdx].servCount < (uint8_t)CY_BLE_SRVI_COUNT) &&
          ((cy_ble_serverInfo[discIdx][cy_ble_discovery[discIdx].servCount].range.startHandle <
            cy_ble_discovery[discIdx].gattcDiscoveryRange.startHandle) ||
           (cy_ble_serverInfo[discIdx][cy_ble_discovery[discIdx].servCount].range.startHandle >
            cy_ble_discovery[discIdx].gattcDiscoveryRange.endHandle)))
    {
        cy_ble_discovery[discIdx].servCount++;
    }

    if(cy_ble_discovery[discIdx].servCount < (uint8_t)CY_BLE_SRVI_COUNT)
    {
        cy_stc_ble_gattc_read_by_type_req_t requestParam =
        {
            .range      = cy_ble_serverInfo[discIdx][cy_ble_discovery[discIdx].servCount].range,
            .connHandle = connHandle
        };
        if(Cy_BLE_GATTC_FindIncludedServices(&requestParam) != CY_BLE_SUCCESS)
        {
            Cy_BLE_ApplCallback((uint32_t)CY_BLE_EVT_GATTC_INCL_DISCOVERY_FAILED, &connHandle);
            cy_ble_discovery[discIdx].autoDiscoveryFlag = 0u;
        }
    }
    else /* An included service discovery procedure is done, start a characteristic discovery procedure */
    {
        if((cy_ble_eventHandlerFlag & CY_BLE_ENABLE_ALL_EVENTS) != 0u)
        {
            Cy_BLE_ApplCallback((uint32_t)CY_BLE_EVT_GATTC_INCL_DISCOVERY_COMPLETE, &connHandle);
        }
        Cy_BLE_SetConnectionState(connHandle, CY_BLE_CONN_STATE_CLIENT_CHAR_DISCOVERING);
        Cy_BLE_NextCharDiscovery(connHandle, CY_BLE_DISCOVERY_INIT);
    }
}



