ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble_event_handler.c
/******************************************************************************
* Function Name: Cy_BLE_GAPC_DiscoverCharacteristicsEventHandler
***************************************************************************//**
*
*  This function is called on receiving a CY_BLE_EVT_GATTC_READ_BY_TYPE_RSP
*  event. Based on the service UUID, an appropriate data structure is populated
*  using the data received as part of the callback.
*
*  \param connHandle:    The connection handle.
*  \param discCharInfo:  The pointer to the characteristic information structure.
*
* \return
*  None
*
******************************************************************************/
static void Cy_BLE_GAPC_DiscoverCharacteristicsEventHandler(cy_stc_ble_disc_char_info_t *discCharInfo)
{
    uint32_t discIdx = Cy_BLE_GetDiscoveryIdx(discCharInfo->connHandle);

    if((discCharInfo->uuidFormat == CY_BLE_GATT_16_BIT_UUID_FORMAT) &&
       (cy_ble_discovery[discIdx].servCount == (uint32_t)CY_BLE_SRVI_GAP))
    {
        switch(discCharInfo->uuid.uuid16)
        {
            case CY_BLE_UUID_CHAR_DEVICE_NAME:
                CY_BLE_GapcCheckCharHandle(cy_ble_discovery[discIdx].gapc.deviceNameCharHandle, discCharInfo);
                break;

            case CY_BLE_UUID_CHAR_APPEARANCE:
                CY_BLE_GapcCheckCharHandle(cy_ble_discovery[discIdx].gapc.appearanceCharHandle, discCharInfo);
                break;

            case CY_BLE_UUID_CHAR_PERIPH_PRIVCY_FLAG:
                CY_BLE_GapcCheckCharHandle(cy_ble_discovery[discIdx].gapc.periphPrivacyCharHandle, discCharInfo);
                break;

            case CY_BLE_UUID_CHAR_RECONNECTION_ADDR:
                CY_BLE_GapcCheckCharHandle(cy_ble_discovery[discIdx].gapc.reconnAddrCharHandle, discCharInfo);
                break;

            case CY_BLE_UUID_CHAR_PRFRRD_CNXN_PARAM:
                CY_BLE_GapcCheckCharHandle(cy_ble_discovery[discIdx].gapc.prefConnParamCharHandle, discCharInfo);
                break;

            case CY_BLE_UUID_CHAR_CENTRAL_ADDRESS_RESOLUTION:
                CY_BLE_GapcCheckCharHandle(cy_ble_discovery[discIdx].gapc.centralAddrResolutionCharHandle, discCharInfo);
                break;

            case CY_BLE_UUID_CHAR_RESOLVABLE_PRIVATE_ADDR_ONLY:
                CY_BLE_GapcCheckCharHandle(cy_ble_discovery[discIdx].gapc.resolvablePrivateAddressOnly, discCharInfo);
                break;

            default:
                break;
        }

        /* Indicate that request was handled */
        cy_ble_eventHandlerFlag &= (uint8_t) ~CY_BLE_CALLBACK;
    }
}



/******************************************************************************
* Function Name: Cy_BLE_ReadByTypeEventHandler
***************************************************************************//**
*
*  Handles a Read By Type Response event during an automatic server discovery
*  process.
*
*  \param eventParam: The event parameters for a Read By Type Response.
*
* \return
*  None.
*
******************************************************************************/
void Cy_BLE_ReadByTypeEventHandler(cy_stc_ble_gattc_read_by_type_rsp_param_t *eventParam)
{
    uint32_t discIdx = Cy_BLE_GetDiscoveryIdx(eventParam->connHandle);
    uint32_t locDataLength;
    uint32_t attrLength;
    uint32_t i;
    uint32_t j;
    uint8_t *attrVal;

    if((discIdx < CY_BLE_CONFIG_GATTC_COUNT) && (cy_ble_discovery[discIdx].autoDiscoveryFlag != 0u))
    {
        /* Count of service information pieces in this mtu */
        locDataLength = (uint32_t)eventParam->attrData.length;
        attrLength = (uint32_t)eventParam->attrData.attrLen;
        attrVal = eventParam->attrData.attrValue;

        if(Cy_BLE_GetConnectionState(eventParam->connHandle) == CY_BLE_CONN_STATE_CLIENT_CHAR_DISCOVERING)
        {
            cy_stc_ble_disc_char_info_t locDiscCharInfo;
            locDiscCharInfo.connHandle = eventParam->connHandle;

            for(i = 0u; i < attrLength; i += locDataLength)
            {
                cy_ble_eventHandlerFlag |= CY_BLE_CALLBACK;

                /* Get Handle for characteristic declaration */
                locDiscCharInfo.charDeclHandle = Cy_BLE_Get16ByPtr(attrVal);
                attrVal += sizeof(locDiscCharInfo.charDeclHandle);

                /* Get Properties for value */
                locDiscCharInfo.properties = *attrVal;
                attrVal += sizeof(locDiscCharInfo.properties);

                /* Get Handle to server database attribute value entry */
                locDiscCharInfo.valueHandle = Cy_BLE_Get16ByPtr(attrVal);
                attrVal += sizeof(locDiscCharInfo.valueHandle);

                /* Get Characteristic UUID (128/16 bit) */
                if(locDataLength == CY_BLE_DISC_CHAR_INFO_128_LEN)
                {
                    locDiscCharInfo.uuidFormat = CY_BLE_GATT_128_BIT_UUID_FORMAT;
                    (void)memcpy(&locDiscCharInfo.uuid.uuid128, attrVal, CY_BLE_GATT_128_BIT_UUID_SIZE);
                    attrVal += CY_BLE_GATT_128_BIT_UUID_SIZE;
                }
                else if(locDataLength == CY_BLE_DISC_CHAR_INFO_LEN)
                {
                    locDiscCharInfo.uuidFormat = CY_BLE_GATT_16_BIT_UUID_FORMAT;
                    locDiscCharInfo.uuid.uuid16 = Cy_BLE_Get16ByPtr(attrVal);
                    attrVal += CY_BLE_GATT_16_BIT_UUID_SIZE;
                }
                else
                {
                    /* Unsupported data length value */
                }

                if((locDataLength == CY_BLE_DISC_CHAR_INFO_128_LEN) || (locDataLength == CY_BLE_DISC_CHAR_INFO_LEN))
                {
                    /* Process common services: GAP and GATT */
                    Cy_BLE_GAPC_DiscoverCharacteristicsEventHandler(&locDiscCharInfo);
                    Cy_BLE_GATTC_DiscoverCharacteristicsEventHandler(&locDiscCharInfo);

                    /* Loop thru all registered services and invoke CY_BLE_EVT_GATTC_DISC_CHAR event */
                    (void)Cy_BLE_InvokeServiceEventHandler((uint32_t)CY_BLE_EVT_GATTC_DISC_CHAR, (void*)&locDiscCharInfo);
                }
            }
            /* The sub-procedure is complete when an Error Response is received and the
             *  Error Code is set to the Attribute Not Found; or the Read By Type Response has an
             *  Attribute Handle equal to the Ending Handle of the request - in this case
             *  a CY_BLE_EVT_GATTC_LONG_PROCEDURE_END event is generated by the stack. */
            cy_ble_eventHandlerFlag &= (uint8_t) ~CY_BLE_CALLBACK;
        }
        else if(Cy_BLE_GetConnectionState(eventParam->connHandle) == CY_BLE_CONN_STATE_CLIENT_INCL_DISCOVERING)
        {
            cy_stc_ble_disc_incl_info_t locDiscInclInfo;
            locDiscInclInfo.connHandle = eventParam->connHandle;

