ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble_event_handler.c
            for(i = 0u; i < attrLength; i += locDataLength)
            {
                cy_ble_eventHandlerFlag |= CY_BLE_CALLBACK;

                locDiscInclInfo.inclDefHandle = Cy_BLE_Get16ByPtr(attrVal);
                attrVal += sizeof(locDiscInclInfo.inclDefHandle);

                locDiscInclInfo.inclHandleRange.startHandle = Cy_BLE_Get16ByPtr(attrVal);
                attrVal += sizeof(locDiscInclInfo.inclHandleRange.startHandle);

                locDiscInclInfo.inclHandleRange.endHandle = Cy_BLE_Get16ByPtr(attrVal);
                attrVal += sizeof(locDiscInclInfo.inclHandleRange.endHandle);

                if(locDataLength == CY_BLE_DISC_INCL_INFO_128_LEN)
                {
                    cy_stc_ble_gattc_stop_cmd_param_t stopCmdParam = { .connHandle = eventParam->connHandle };
                    cy_stc_ble_gattc_read_req_t readReqParam =
                    {
                        .attrHandle = locDiscInclInfo.inclHandleRange.startHandle,
                        .connHandle = eventParam->connHandle
                    };
                    locDiscInclInfo.uuidFormat = CY_BLE_GATT_128_BIT_UUID_FORMAT;

                    /* Stop ongoing GATT operation */
                    (void)Cy_BLE_GATTC_StopCmd(&stopCmdParam);

                    /* Get the included service UUID when the included service uses a 128-bit
                     * UUID, a Read Request is used. The Attribute Handle for the Read Request is
                     * the Attribute Handle of the included service.
                     */

                    if(Cy_BLE_GATTC_ReadCharacteristicValue(&readReqParam) == CY_BLE_SUCCESS)
                    {
                        /* Save handle to support a read response from device */
                        cy_ble_discovery[discIdx].inclInfo = locDiscInclInfo;
                    }
                    else
                    {
                        Cy_BLE_ApplCallback((uint32_t)CY_BLE_EVT_GATTC_INCL_DISCOVERY_FAILED, &eventParam->connHandle);
                        cy_ble_discovery[discIdx].autoDiscoveryFlag = 0u;
                    }
                }
                else if(locDataLength == CY_BLE_DISC_INCL_INFO_LEN)
                {
                    locDiscInclInfo.uuidFormat = CY_BLE_GATT_16_BIT_UUID_FORMAT;
                    locDiscInclInfo.uuid.uuid16 = Cy_BLE_Get16ByPtr(attrVal);
                    attrVal += CY_BLE_GATT_16_BIT_UUID_SIZE;

                    /* Store the range of the included service in the list of services for discovery */
                    for(j = 0u; j < (uint32_t)CY_BLE_SRVI_COUNT; j++)
                    {
                        if(cy_ble_serverInfo[discIdx][j].uuid == locDiscInclInfo.uuid.uuid16)
                        {
                            if(cy_ble_serverInfo[discIdx][j].range.startHandle == CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE)
                            {
                                cy_ble_serverInfo[discIdx][j].range = locDiscInclInfo.inclHandleRange;
                                break;
                            }
                        }
                    }
                }
                else
                {
                    /* Unsupported data length value */
                }

                /* Loop thru all registered services and invoke CY_BLE_EVT_GATTC_DISC_INCL event */
                (void)Cy_BLE_InvokeServiceEventHandler((uint32_t)CY_BLE_EVT_GATTC_DISC_INCL, (void*)&locDiscInclInfo);
            }
            cy_ble_eventHandlerFlag &= (uint8_t) ~CY_BLE_CALLBACK;
        }
        else
        {
            /* Unhandled state value */
        }
    }
}


/******************************************************************************
* Function Name: Cy_BLE_NextCharDiscovery
***************************************************************************//**
*
*  Looks for a characteristic handle range for the current service (pointed by
*   cy_ble_disCount). If the current range is invalid (any of start or end
*   handles is invalid), then increments the cy_ble_disCount and check
*   the next service range and does so until a valid range is caught or the end
*   of the service set is reached.
*
*  \param connHandle:     The connection handle.
*  \param incrementIndex: A non-zero value indicates that the characteristic index
*                         should be incremented.
*
* \return
*  None.
*
******************************************************************************/
void Cy_BLE_NextCharDiscovery(cy_stc_ble_conn_handle_t connHandle,
                              uint8_t incrementIndex)
{
    uint32_t discIdx = Cy_BLE_GetDiscoveryIdx(connHandle);

    if(incrementIndex != CY_BLE_DISCOVERY_INIT)
    {
        cy_ble_discovery[discIdx].servCount++;
    }
    else
    {
        cy_ble_discovery[discIdx].servCount = 0u;
    }

    /* Skip not existing services and services out of the discovery range */
    while((cy_ble_discovery[discIdx].servCount < (uint32_t)CY_BLE_SRVI_COUNT) &&
          ((cy_ble_serverInfo[discIdx][cy_ble_discovery[discIdx].servCount].range.startHandle <
            cy_ble_discovery[discIdx].gattcDiscoveryRange.startHandle) ||
           (cy_ble_serverInfo[discIdx][cy_ble_discovery[discIdx].servCount].range.startHandle >
            cy_ble_discovery[discIdx].gattcDiscoveryRange.endHandle)))
    {
        cy_ble_discovery[discIdx].servCount++;
    }

    if(cy_ble_discovery[discIdx].servCount < (uint8_t)CY_BLE_SRVI_COUNT)
    {
        cy_stc_ble_gattc_read_by_type_req_t reqParam =
        {
            .connHandle = connHandle,
            .range      = cy_ble_serverInfo[discIdx][cy_ble_discovery[discIdx].servCount].range
        };
        if(Cy_BLE_GATTC_DiscoverCharacteristics(&reqParam) != CY_BLE_SUCCESS)
        {
            Cy_BLE_ApplCallback((uint32_t)CY_BLE_EVT_GATTC_CHAR_DISCOVERY_FAILED, &connHandle);
            cy_ble_discovery[discIdx].autoDiscoveryFlag = 0u;
        }
    }
    else /* A Characteristic discovery procedure is done, start a descriptor discovery procedure */
    {
        if((cy_ble_eventHandlerFlag & CY_BLE_ENABLE_ALL_EVENTS) != 0u)
        {
            Cy_BLE_ApplCallback((uint32_t)CY_BLE_EVT_GATTC_CHAR_DISCOVERY_COMPLETE, &connHandle);
        }
        Cy_BLE_SetConnectionState(connHandle, CY_BLE_CONN_STATE_CLIENT_DESCR_DISCOVERING);
        Cy_BLE_NextCharDscrDiscovery(connHandle, CY_BLE_DISCOVERY_INIT);
    }
}


