ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble_event_handler.c
/******************************************************************************
* Function Name: Cy_BLE_FindInfoEventHandler
***************************************************************************//**
*
*  Handles a Find Info Response event during an automatic server discovery
*  process.
*
*  \param eventParam:  The event parameters for a Find Info Response.
*
* \return
*  None.
*
******************************************************************************/
void Cy_BLE_FindInfoEventHandler(cy_stc_ble_gattc_find_info_rsp_param_t *eventParam)
{
    uint32_t discIdx = Cy_BLE_GetDiscoveryIdx(eventParam->connHandle);
    uint32_t locDataLength;
    uint32_t attrLength;
    uint32_t i;
    uint8_t *attrVal;

    /* Discovery descriptor information */
    cy_stc_ble_disc_descr_info_t locDiscDescrInfo;

    locDiscDescrInfo.descrHandle = CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE;

    if((Cy_BLE_GetConnectionState(eventParam->connHandle) == CY_BLE_CONN_STATE_CLIENT_DESCR_DISCOVERING) &&
       (discIdx < CY_BLE_CONFIG_GATTC_COUNT) && (cy_ble_discovery[discIdx].autoDiscoveryFlag != 0u))
    {
        attrLength = eventParam->handleValueList.byteCount;    /* Number of elements on list in bytes */
        locDiscDescrInfo.uuidFormat = eventParam->uuidFormat;
        locDiscDescrInfo.connHandle = eventParam->connHandle;

        if(locDiscDescrInfo.uuidFormat == CY_BLE_GATT_16_BIT_UUID_FORMAT)
        {
            locDataLength = CY_BLE_DB_ATTR_HANDLE_LEN + CY_BLE_GATT_16_BIT_UUID_SIZE;
        }
        else
        {
            locDataLength = CY_BLE_DB_ATTR_HANDLE_LEN + CY_BLE_GATT_128_BIT_UUID_SIZE;
        }
        attrVal = eventParam->handleValueList.list;

        for(i = 0u; i < attrLength; i += locDataLength)
        {
            cy_ble_eventHandlerFlag |= CY_BLE_CALLBACK;

            locDiscDescrInfo.descrHandle = Cy_BLE_Get16ByPtr(attrVal);
            attrVal += CY_BLE_DB_ATTR_HANDLE_LEN;


            if(locDiscDescrInfo.uuidFormat == CY_BLE_GATT_128_BIT_UUID_FORMAT)
            {
                (void)memcpy(&locDiscDescrInfo.uuid.uuid128, attrVal, CY_BLE_GATT_128_BIT_UUID_SIZE);
                attrVal += CY_BLE_GATT_128_BIT_UUID_SIZE;
            }
            else
            {
                locDiscDescrInfo.uuid.uuid16 = Cy_BLE_Get16ByPtr(attrVal);
                attrVal += CY_BLE_GATT_16_BIT_UUID_SIZE;
            }

            /* Process common services: GATT */
            Cy_BLE_GATTC_DiscoverCharDescriptorsEventHandler(&locDiscDescrInfo);

            /* Loop thru all registered services and invoke CY_BLE_EVT_GATTC_DISC_CHAR event */
            (void)Cy_BLE_InvokeServiceEventHandler((uint32_t)CY_BLE_EVT_GATTC_DISC_DESCR, (void*)&locDiscDescrInfo);
        }

        /* The sub-procedure is complete when an Error Response is received and the
         * Error Code is set to the Attribute Not Found or the Find Information Response has
         * an Attribute Handle that is equal to the Ending Handle of the request in this
         * case a CY_BLE_EVT_GATTC_LONG_PROCEDURE_END event is generated by the stack. */

        cy_ble_eventHandlerFlag &= (uint8_t) ~CY_BLE_CALLBACK;
    }
}


/******************************************************************************
* Function Name: Cy_BLE_NextCharDscrDiscovery
***************************************************************************//**
*
*  Looks for a handle range for the current descriptor (pointed by
*   cy_ble_discovery[discIdx].servCount). If the current range is invalid (any of start or end
*   handles is invalid), then increments the cy_ble_discovery[discIdx].servCount and check
*   the next descriptor range and does so until a valid range is caught or the
*   end of the descriptor set is reached.
*
*  \param connHandle:     The connection handle.
*  \param incrementIndex: A non-zero value indicates that the characteristic index should be
*                         incremented.
*
* \return
*  None.
*
******************************************************************************/
void Cy_BLE_NextCharDscrDiscovery(cy_stc_ble_conn_handle_t connHandle,
                                  uint8_t incrementIndex)
{
    uint32_t discIdx = Cy_BLE_GetDiscoveryIdx(connHandle);
    cy_stc_ble_disc_range_info_t charRangeInfo = { .connHandle = connHandle, .srviIncIdx = incrementIndex };

    do
    {
        cy_ble_eventHandlerFlag |= CY_BLE_CALLBACK;
        charRangeInfo.range.startHandle = CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE;
        charRangeInfo.range.endHandle = CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE;

        if(incrementIndex == CY_BLE_DISCOVERY_INIT)
        {
            cy_ble_discovery[discIdx].servCount = 0u;
            cy_ble_discovery[discIdx].charCount = 0u;
            incrementIndex = CY_BLE_DISCOVERY_CONTINUE;
        }

        /* Get a possible range of the common service: GATT */
        Cy_BLE_GATTC_GetCharRange(&charRangeInfo);

        /* Loop thru all registered services and get a possible range of the characteristic descriptor */
        (void)Cy_BLE_InvokeServiceEventHandler((uint32_t)CY_BLE_EVT_GATTC_DISC_DESCR_GET_RANGE, (void*)&charRangeInfo);

        if((charRangeInfo.range.startHandle == CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE) ||
           (charRangeInfo.range.endHandle == CY_BLE_GATT_INVALID_ATTR_HANDLE_VALUE))
        {
            cy_ble_discovery[discIdx].servCount++;
            cy_ble_discovery[discIdx].charCount = 0u;
            charRangeInfo.srviIncIdx = CY_BLE_DISCOVERY_INIT;
        }
        else
        {
            charRangeInfo.srviIncIdx = CY_BLE_DISCOVERY_CONTINUE;
        }

        /* Skip not existing characteristics and characteristics out of discovery range */
    }
    while(((charRangeInfo.range.startHandle <= cy_ble_discovery[discIdx].gattcDiscoveryRange.startHandle) ||
           (charRangeInfo.range.startHandle > cy_ble_discovery[discIdx].gattcDiscoveryRange.endHandle) ||
           (charRangeInfo.range.endHandle < cy_ble_discovery[discIdx].gattcDiscoveryRange.startHandle) ||
           (charRangeInfo.range.startHandle > charRangeInfo.range.endHandle)) &&
          (cy_ble_discovery[discIdx].servCount < (uint8_t)CY_BLE_SRVI_COUNT));

    if(cy_ble_discovery[discIdx].servCount < (uint32_t)CY_BLE_SRVI_COUNT)
    {
        cy_stc_ble_gattc_find_info_req_t reqParam =
        {
            .connHandle = connHandle,
            .range      = charRangeInfo.range
        };

