ARMmbed/mbed-os/targets/TARGET_Cypress/TARGET_PSoC6/device/middleware/ble/cy_ble_event_handler.c
        if(Cy_BLE_GATTC_DiscoverCharacteristicDescriptors(&reqParam) != CY_BLE_SUCCESS)
        {
            Cy_BLE_ApplCallback((uint32_t)CY_BLE_EVT_GATTC_DESCR_DISCOVERY_FAILED, &connHandle);
            cy_ble_discovery[discIdx].autoDiscoveryFlag = 0u;
        }
    }
    else /* Discovery done */
    {
        Cy_BLE_SetConnectionState(connHandle, CY_BLE_CONN_STATE_CLIENT_DISCOVERED);
        Cy_BLE_ApplCallback((uint32_t)CY_BLE_EVT_GATTC_DISCOVERY_COMPLETE, &connHandle);
        cy_ble_discovery[discIdx].autoDiscoveryFlag = 0u;
    }
}

/******************************************************************************
* Function Name: Cy_BLE_LongProcedureEndEventHandler
***************************************************************************//**
*
*  Handles a Long Procedure End event during an automatic server discovery
*  process.
*
*  \param connHandle:  The connection handle.
*
* \return
*  None
*
******************************************************************************/
void Cy_BLE_LongProcedureEndEventHandler(cy_stc_ble_conn_handle_t connHandle)
{
    uint32_t discIdx = Cy_BLE_GetDiscoveryIdx(connHandle);

    if((discIdx < CY_BLE_CONFIG_GATTC_COUNT) && (cy_ble_discovery[discIdx].autoDiscoveryFlag != 0u))
    {
        switch(Cy_BLE_GetConnectionState(connHandle))
        {
            case CY_BLE_CONN_STATE_CLIENT_SRVC_DISCOVERING:
                if((cy_ble_eventHandlerFlag & CY_BLE_ENABLE_ALL_EVENTS) != 0u)
                {
                    Cy_BLE_ApplCallback((uint32_t)CY_BLE_EVT_GATTC_SRVC_DISCOVERY_COMPLETE, &connHandle);
                }
                Cy_BLE_SetConnectionState(connHandle, CY_BLE_CONN_STATE_CLIENT_INCL_DISCOVERING);
                Cy_BLE_NextInclDiscovery(connHandle, CY_BLE_DISCOVERY_INIT);
                /* Do not propagate this event to the application level during an automatic discovery procedure */
                cy_ble_eventHandlerFlag &= (uint8_t) ~CY_BLE_CALLBACK;
                break;

            case CY_BLE_CONN_STATE_CLIENT_INCL_DISCOVERING:
                Cy_BLE_NextInclDiscovery(connHandle, CY_BLE_DISCOVERY_CONTINUE);
                cy_ble_eventHandlerFlag &= (uint8_t) ~CY_BLE_CALLBACK;
                break;

            case CY_BLE_CONN_STATE_CLIENT_CHAR_DISCOVERING:
                Cy_BLE_NextCharDiscovery(connHandle, CY_BLE_DISCOVERY_CONTINUE);
                cy_ble_eventHandlerFlag &= (uint8_t) ~CY_BLE_CALLBACK;
                break;

            case CY_BLE_CONN_STATE_CLIENT_DESCR_DISCOVERING:
                Cy_BLE_NextCharDscrDiscovery(connHandle, CY_BLE_DISCOVERY_CONTINUE);
                cy_ble_eventHandlerFlag &= (uint8_t) ~CY_BLE_CALLBACK;
                break;

            default:
                break;
        }
    }
}


/******************************************************************************
* Function Name: Cy_BLE_ErrorResponseEventHandler
***************************************************************************//**
*
*  Handles an Error Response event during an automatic server discovery
*  process.
*
*  \param eventParam:  The event parameters for an Error Response.
*
* \return
*  None
*
******************************************************************************/
void Cy_BLE_ErrorResponseEventHandler(const cy_stc_ble_gatt_err_param_t *eventParam)
{
    uint32_t discIdx = Cy_BLE_GetDiscoveryIdx(eventParam->connHandle);

    if((discIdx < CY_BLE_CONFIG_GATTC_COUNT) && (cy_ble_discovery[discIdx].autoDiscoveryFlag != 0u) &&
       (eventParam->errInfo.errorCode == CY_BLE_GATT_ERR_ATTRIBUTE_NOT_FOUND))
    {
        Cy_BLE_LongProcedureEndEventHandler(eventParam->connHandle);
    }
}

#endif /* CY_BLE_GATT_ROLE_CLIENT */
#endif /* defined(CY_BLE_MODE_PROFILE) */
#ifdef __cplusplus
}
#endif /* __cplusplus */

/* [] END OF FILE */
